#include <iostream>
#include <vector>
#include <string>


//-------------------------------------------------------------------------------------------------
class Human
{

};
//-------------------------------------------------------------------------------------------------
class Professor : public
{

};
//-------------------------------------------------------------------------------------------------
class Student : public
{

};
//-------------------------------------------------------------------------------------------------
int main()
{
    std::setlocale(LC_ALL, "ru");

    // Human
    //   Professor
    //   Student


    // name (имя) , age (возраст)
    // student - course (курс 1 - 4)
    // professor - predmet (математика, химия, история)

    // greating(приветствие)
    // student - Я "имя", мне %%% лет, я на %%% курсе
    // professor - Я профессор "имя", мне %%% лет, я преподаю %%%%%



    std::vector<Human*> v = createHumans();

    printHumansGreating(v); // выводит приветствия всех кто у меня в векторе

    bool find = findHuman(v, "Vasya");
    if (find)
    {
        std::cout << "нашли " << std::endl;
    }

    printKolichestvoChelovek(v); /// 4 humans


    return 0;
}
//-------------------------------------------------------------------------------------------------

